onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕК_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ЕК_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕК_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
// Контеева Е., Нетология, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду {   
	
	// Программный вывод созданного реквизита на форму  
	ЭлементФормы = Элементы.Добавить("ЕК_СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛево);
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.Заголовок = "Согласованная скидка";
	ЭлементФормы.ПутьКДанным = "Объект.ЕК_СогласованнаяСкидка";  
	// вопрос о пересчете при изменении согласованной скидке
	ЭлементФормы.УстановитьДействие("ПриИзменении", "ЕК_СогласованаяСкидкаПриИзмененииНаКлиенте");
	
	// Программное создание команды ПересчитатьСкидку
	НоваяКоманда = Команды.Добавить("ЕК_ПересчитатьСкидку");
	НоваяКоманда.Заголовок = "Пересчитать скидку (Контеева Е.)";  
	НоваяКоманда.Действие = "ЕК_ПересчетСтоимостиПоСкидкеВЗаказеПокупателя";   
	
	// Программное добавление команды на форму
	ЭлементФормы = Элементы.Добавить("ЕК_ПересчитатьСкидку", Тип("КнопкаФормы"), КоманднаяПанель);
	ЭлементФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	ЭлементФормы.ИмяКоманды = "ЕК_ПересчитатьСкидку"; 
	
// } Контеева Е., Нетология, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду 
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество*((100-Объект.ЕК_СогласованнаяСкидка)/100);
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте 
Процедура ЕК_ПересчетСтоимостиПоСкидкеВЗаказеПокупателя (Команда)  
	
	// Контеева Е., Нетология, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду {   

// действие команды ПересчитатьСкидку
	
	Если ЗначениеЗаполнено(Объект.Товары) Или ЗначениеЗаполнено(Объект.Услуги) Тогда 
		ОповещениеОЗавершении = Новый ОписаниеОповещения ("ЕК_ОбработатьОтветПересчитатьСуммуПоСкидке", ЭтотОбъект);                   
		ПоказатьВопрос (ОповещениеОЗавершении, "Пересчитать суммы с учетом скидки?", РежимДиалогаВопрос.ДаНет); 
	Иначе
		Возврат;
	КонецЕсли;
	
// } Контеева Е., Нетология, 12.06.2023, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду 
	
КонецПроцедуры

&НаКлиенте
Процедура ЕК_СогласованаяСкидкаПриИзмененииНаКлиенте (Элемент)  
	
// Контеева Е., Нетология, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду {   

// действие при изменении согласованной скидки на форме
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения ("ЕК_ОбработатьОтветПересчитатьСуммуПоСкидке", ЭтотОбъект);                   
		ПоказатьВопрос (ОповещениеОЗавершении, "Пересчитать суммы с учетом измененной скидки?", РежимДиалогаВопрос.ДаНет);  
		
// } Контеева Е., Нетология, 12.06.2023, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду 

КонецПроцедуры

&НаКлиенте
Процедура ЕК_ОбработатьОтветПересчитатьСуммуПоСкидке (Ответ, ДополнительныеПараметры) Экспорт 
	
// Контеева Е., Нетология, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду {  
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
		Для Каждого СтрокаТоваров из Объект.Товары Цикл 
			РассчитатьСуммуСтроки(СтрокаТоваров);  			
		КонецЦикла;  
		
		Для Каждого СтрокаУслуг из Объект.Услуги Цикл 
			РассчитатьСуммуСтроки(СтрокаУслуг);  			
		КонецЦикла;
	Иначе 
		Возврат;
	КонецЕсли;   
	
// } Контеева Е., Нетология, 12.06.2023, 13.06.2023, добавлен реквизит ЕК_СогласованнаяСкидка в ЗаказПокупателя, программно выведен на форму ЗаказПокупателя, 
//внесена возможность пересчета стоимости товаров и услуг по указанной скидке через команду 
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
